// 1. Активируем чтение файла .env, чтобы Node.js видел переменную DATABASE_URL
require('dotenv').config();

const express = require('express'); //набор команд для упрощения работы с джиэс
const bcrypt = require('bcryptjs'); //для хэширования пароля
const jwt = require('jsonwebtoken'); //для создания токенов (аутентификации)
const app = express(); //сократили функцию экспресса до "апп."

// 2. Импортируем стандартный класс PrismaClient
const { PrismaClient } = require('@prisma/client');

// 3. Импортируем тот самый новый адаптер-переводчик для PostgreSQL
const { PrismaPg } = require('@prisma/adapter-pg');

// 4. Создаем адаптер, передавая ему ссылку на нашу базу данных из .env
const adapter = new PrismaPg({ connectionString: process.env.DATABASE_URL });

// 5. Создаем клиента Призмы и передаем ему этот адаптер!
const prisma = new PrismaClient({ adapter: adapter });

// 6. Создаем куки парсер для работы с файлами куки (нужно для хранения токена-авторизации в куки)
const cookieParser = require('cookie-parser');

// ... дальше ваш код (app.use, app.get и т.д.) идет без изменений!

app.use (express.json()); //используем ряд функций, среди которых парсинг (чтение и обработка данных)
app.use (cookieParser('СЕКРЕТНОЕ_СЛОВО_ДЛЯ_ПОДПИСИ')); // Теперь в каждом роуте у нас появится объект req.cookies, Передаем секретное слово для подписи кук 

// Заголовки CORS настроены на Allow-Credentials: true, открывая зелёный свет для безопасного браузерного фронтенда
// app.use((req, res, next) => {
//     res.setHeader('Access-Control-Allow-Origin', 'http://localhost:3000'); // Вместо звездочки пишем явный адрес
//     res.setHeader('Access-Control-Allow-Methods', 'GET, POST, PUT, DELETE, OPTIONS');
//     res.setHeader('Access-Control-Allow-Headers', 'Content-Type, Authorization');
//     res.setHeader('Access-Control-Allow-Credentials', 'true'); // КАТЕГОРИЧЕСКИ ВАЖНО: разрешает передачу кук!
//     next();
// });

function authenticateToken (req, res, next)
    {
        const token = req.cookies.token;
        
        //старого швейцара с деменцией убираем

        //const authHeader = req.headers['authorization']; //По стандартам интернета, токены присылают в скрытом заголовке запроса под названием Authorization
        // Обычно заголовок 'headers' выглядит как строка: Bearer (далее например:) <eyJhbGciOiJIUzI1NiIsInR5cCI>. 
        // Нам нужно забрать только вторую часть (сам токен). Для этого разработчики очищают строку:
        //const token = authHeader && authHeader.split(' ')[1]; // && "правый" швейцар с деменцией, смотрит на левую часть, если в ней что-то есть то "ОК", идём дальше, смотрит на правую часть - что-то есть?
        // Круто, записываем это в результат token!
        // В случае если в левой части будет пустота, то он её присвоит токену (что за ах-логика..)

        // Сравнивает authHeader И authHeader.split(' ')[1];
        // Если слева пустота, то останавливает работу и возвращает пустоту в переменную токен;
        // Зачем это нужно? 
        // Если бы мы написали просто const token = authHeader.split(' ')[1];, а пользователь отправил запрос вообще без заголовка, 
        // компьютер попытался бы вызвать метод .split() у пустоты (undefined). 
        // Из-за этого ваш сервер Node.js тут же упал бы с критической ошибкой TypeError: 
        // Cannot read properties of undefined (reading 'split'). Склеивание через && — это изящная страховка «на лету».

        // Метод .split(' ') — берет эту строку и разрезает её на кусочки везде, где встречает пробел (который мы указали в круглых скобок). 
        // На выходе получается массив из двух элементов:Ячейка [0]: Слово "Bearer"Ячейка [1]: Сам длинный токен "eyJhbGci..."
        // Квадратные скобки [1] на конце — говорят компьютеру: «Так, ты разрезал строку на массив из двух кусочков. 
        // Кусочек под номером 0 (слово Bearer) нам не нужен, выкинь его. Возьми кусочек под номером 1 (сам токен)».
        // И этот чистый токен без лишних слов записывается в константу token

        // «Компьютер, проверь, прислал ли пользователь заголовок authHeader. Если не прислал — не ломайся, а просто запиши в token пустоту. 
        // А если прислал — разрежь эту строку по пробелу и возьми вторую часть, где лежит сам токен».
        if (!token) return res.sendStatus(401); //в случае если токена нет вообще выдаём сис.ошибку;

        jwt.verify(token, 'СЕКРЕТНОЕ_СЛОВО_ДЛЯ_ПОДПИСИ', (err, user) => //верификация, берёт токен, секретное слово, ошибку (если таковая имеется в токене, id user-a)
        //(err, user) => { ... }. Это встроенная функция обратного вызова (Callback)
        // Метод jwt.verify берет token и 'СЕКРЕТНОЕ_СЛОВО_ДЛЯ_ПОДПИСИ' и проводит мгновенный расчет подписи.

        // После расчёта Метод jwt.verify автоматически запускает вашу мини-программу в скобках и передает в неё два результата (аргумента):err (Ошибка): 
        // Если токен поддельный, изменен хакером или у него просто истек срок годности (прошел 1 час), Призма/JWT запишет информацию об ошибке в 
        // эту переменную err. Если всё хорошо, там будет пусто (null).user (Расшифрованные данные): Если токен настоящий, компьютер успешно достанет 
        // из него ту самую полезную нагрузку, которую мы зашивали при логине — объект { userId: user.id } — и запишет его в переменную user.
            {
                if (err) 
                    {
                        return res.sendStatus(403); // Проверяем, появилась ли ошибка в переменной err, Ошибка 403 Forbidden (Токен поддельный или просрочен), ошибка будет в случае изменения токена от момента его создания до момента проверки
                    }
                // Если ошибка есть, мы бьем пользователя кодом 403 Forbidden (Доступ запрещен, токен «битый»)
                // Если ошибки нет, код идет на следующую строчку:
                
                req.user = user; //изначально запрос от пользователя подаётся "обезличенно", мы используем функцию верификации для того чтобы "наделить его личиной", приклеиваем к его запросу его id
                // чтобы другие функции могли понимать что это конкретный пользователь !userName

                // Записываем расшифрованного юзера (его id) прямо внутрь запроса req!
                // Объект req (Request / Запрос) — это сквозной поезд, который едет через весь ваш сервер от момента, когда пользователь кликнул 
                // кнопку, до момента, когда сервер отдал ответ.Мы берем расшифрованные данные пользователя (его userId) и принудительно 
                // подсаживаем их в этот поезд — создаем новое свойство req.user.

                // Благодаря этой строчке, во всех следующих функциях (например, при создании задачи) нам больше не нужно будет спрашивать у пользователя его ID. 
                // Мы сможем просто написать const authorId = req.user.userId; — и сервер будет железно знать, кто именно сейчас отправляет запрос


                next(); // Она буквально говорит серверу: «Всё отлично! Токен проверен, ID пользователя сохранен в поезде req. 
                // Шлагбаум открывается, пропускай этот запрос дальше к коду работы с задачами!»

                // «Библиотека JWT, проверь этот token с помощью нашего секретного слова. Если он фальшивый или просроченный — верни ошибку err 
                // и мы выгоним пользователя с кодом 403. А если он настоящий — достань из него данные пользователя, запиши их в поезд req.user 
                // для следующих функций и дай зеленый свет next(), чтобы пропустить запрос дальше».
            });
    }

app.get('/tasks', authenticateToken, async (req, res) => //дверь для запросов по адресу /tasks (название файла-бд локальной); синхронный код это очередь в магазине, асинхронный это офик, который бегает по столам и пока "кухня" обрабатывает один, он уже бежит за другим
    {
        const currentUserId = req.user.userId; //вытаскиваем идентификатор пользователя из  запроса пользователя, в методе аутентификации присвоили айди юзера к его запросу
        const tasks = await prisma.task.findMany
            ({
                where: { userId: currentUserId }
            }); //наш «покупатель» ставится на паузу. Программа говорит: «Так, мы отправили запрос в базу данных PostgreSQL. Пока база ищет задачи, код ВНУТРИ ЭТОЙ КОНКРЕТНОЙ функции ДАЛЬШЕ не идет. Ждем ответ».
        return res.send(tasks); //отправляем таскс
    })

app.post('/register', async (req, res) => //(для регистрации пользователей)
    {
        const { email, password } = req.body; //достаём из тела запроса email и password
        // это сокращение от двух строчек: 
        // const email = req.body.email;
        // const password = req.body.password;
        // то есть мы принимаем в теле объекта переменные email и password одной командой 
        // красивый, лаконичный способ распаковать объект в отдельные переменные за один шаг

        const hashedPassword = await bcrypt.hash(password, 10); // Число 10 — это "соль" (количество раундов шифрования). 
        // Чем выше, тем надежнее, но 10 — это золотой стандарт скорости и защиты.
        // На этом этапе мы хэшируем полученный от пользователя пароль
        const newUser = await prisma.user.create //метод для создания юзеров, в него мы записываем email и хэш.пароль hashedPassword
        (
            {
                data:
                    {
                        email:email,
                        password: hashedPassword // Записываем в базу именно ХЕШ, а не чистый пароль!
                    }
            }
        )
        return res.send(`Пользователь'${newUser.email},' успешно зарегистрирован!` );
    }) 


//app.get('/login', async (req, res) => //(для аутентификации пользователей) //для проверки в браузере
app.post('/login', async (req, res) => //(для аутентификации пользователей)
    {
        const { email, password } = req.body; //достаём из тела запроса email и password
        //const { email, password } = req.query; //для проверки в браузере
        const user = await prisma.user.findUnique //проверить, есть ли вообще такой имейл в базе данных
        ({
            where: { email: email }
        });
        if (!user)
        {
            return res.status(400).send({ error: "Неверный email или пароль" }); //в случае несхождения юзера возвращает ошибку, функция останавливается
        }
            
        const isMatch = await bcrypt.compare(password, user.password); //bcrypt возьмет присланный пароль, захеширует его с теми же настройками и сравнит получившиеся хеши
        //подробнее:
        //1. берёт user.password (это старый хэш пароля от этого же пользователя, который он получил когда тот регистрировался);
        //2. из старого хэша он берёт версию алгоритма, (например, 2а), кол-во раундов перемешивания (10, 2^10=1024 раза), добавляет соль (билиберду символов приплетает)
        //3. берёт password (новый пароль который тока что получил от пользователя) и делает всё то же самое что во втором пункте;
        //4. если пароли совпадают, то и хэш у них будет совпадать
        
        if (!isMatch)
        {
            return res.status(400).send({ error: "Неверный email или пароль" }); //в случае несхождения пароля возвращает ошибку, функция останавливается
        }
                
        const token = jwt.sign //Создание «Пропуска» (JWT): Если всё совпало, создаем токен
        //подробнее:
        //1. Когда пользователь успешно ввел пароль, мы берем его уникальный номер из базы данных (например, id: 5) и прячем в токен
        // Эта часть токена (секретный ключ "userId: user.id") не зашифрована намертво. 
        // Закодирована в специальный текстовый формат (Base64)
        // Перехвативший токен, может зайти на сайт jwt.io
        // Вставить его туда и прочитать: «Ага, внутри лежит userId: 5»
        // Правило безопасности: 
        // Из-за этого внутрь токена категорически нельзя класть секретные данные: 
        // пароли, номера карт или личные телефоны. 
        // Туда кладут только открытые идентификаторы (ID, email, роль пользователя).

        //2. Это длинная секретная строка (пароль), которую знает только ваш сервер. 
        // Она хранится в файле .env и никогда не отправляется пользователю.
        // На основе этого секретного слова 'СЕКРЕТНОЕ_СЛОВО_ДЛЯ_ПОДПИСИ' алгоритм Призмы/JWT берет ваши данные (userId: 5), 
        // смешивает их с секретным словом и генерирует третью часть токена — Цифровую подпись (Signature)

        (
            { 
                userId: user.id // Что зашифровать внутрь токена (наша полезная нагрузка)
            }, 
                'СЕКРЕТНОЕ_СЛОВО_ДЛЯ_ПОДПИСИ', // Секретный ключ сервера, который знаем только мы
            { 
                expiresIn: '1h' // Срок годности токена (например, 1 час)
            } 
        );

        // Отправляем токен в куки под именем 'token'
        return res.cookie ('token', token,  //'имя_куки_в_браузере', значение_которое_туда_кладем { настройки }
            {
                httpOnly: true, // ГЛАВНОЕ ПРАВИЛО: защищает куку от кражи скриптами прячет эту куку в изолированный системный контейнер
                // Временно комментируем эту строку для локального теста в консоли:
                secure: process.env.NODE_ENV === 'production', // Кука передается только по защищенному HTTPS (включаем только на живом сервере)
                // решает проблему: как сделать так, чтобы код работал и на компьютере программиста, и на живом защищенном сайте, не меняя настройки вручную.
                // process.env - хранит системные настройки вашего компьютера или сервера (переменные окружения)
                // NODE_ENV — это общемировой стандарт названия переменной, которая говорит, в каком режиме сейчас запущен сервер (development и production, разработка и производство соответственно
                // сравнение с === 'production', если 'false' - находится в режиме разработка
                // флаг secure: true - запрещает браузеру отправлять куку по обычному незащищенному протоколу http://. 
                // Браузер согласится отправить её только по зашифрованному протоколу https://. 
                // Если хакер попытается перехватить Wi-Fi трафик пользователя, он не сможет перехватить токен, потому что сеть будет требовать шифрование.
                // если жёстко написать 'secure: true' то во время разработки на домашнем пк куки в браузере создаваться не будут, а я потрачу кучу времени чтобы понять что не так

                maxAge: 3600000 // Срок жизни куки в миллисекундах (1 час, совпадает с JWT)
            }).send({ message: "Успешный вход в систему!" }); // Отправляем просто текстовый успех
    })


app.post('/tasks', authenticateToken, async (req, res) =>  //(для задач) создали независимый блок app.post (научим сервер принимать новые задачи и записывать их в файл. Это делается через POST-запрос.), async функция
    {
        const currentUserId = req.user.userId; //ловим айди пользователя, подавшего запрос, вставляем её в переменную currentUserId
        const text = req.body.text; //В переменную text мы поймали то, что прислал пользователь.
        const newTask = await prisma.task.create //метод для создания записи, принимает внутрь обязатлельное служебное поле "data", в него мы передаём наши столбцы (text:text)
        (
            {
                data:
                    {
                        text:text,
                        //id здесь передавать не нужно! Благодаря нашей миграции и правилу @default(autoincrement()) (в файле schema.prisma конфиг написан)
                        //PostgreSQL сама сгенерирует порядковый номер для новой задачи)
                        userId:currentUserId
                    }

            }   
        )
        return res.send(newTask); //отправляем таскс
    })

app.delete('/tasks/:id', authenticateToken, async (req, res) => //Метод для операции УДАЛЕНИЕ
    {
        const currentUserId = req.user.userId; //ловим айди пользователя, подавшего запрос, вставляем её в переменную currentUserId
        const id = Number(req.params.id); //принимает введённый номер пользователем как айди при запросе delete .../tasks/id (вместо айди вводит цифру)
        // В блок try мы кладем код, который ХОТИМ ПОПРОБОВАТЬ выполнить
        try {
                const deletedTask = await prisma.task.delete //метод для удаления записи, принимает внутрь объект 'where' которое означает "где/при условии что"
                (
                    {
                        where:
                            {
                                id:id,
                                userId:currentUserId
                            }
                    }
                )
                return res.send (`Задача: {"${deletedTask.id}" - "${deletedTask.text}"} успешно удалена!`); //выводит текст, айди задачи, текст, текст задачи, текст   
            }
        // Если Призма выдала ошибку (запись не найдена), код мгновенно прыгает в блок catch!
        catch (error) 
            {
                // Ловим ошибку и вместо падения сервера отдаем аккуратный статус 404 (Не найдено)
                return res.status(404).send({ error: "Задача не найдена или доступ запрещен" });
            }   
    })

app.put('/tasks/:id', authenticateToken, async (req, res) => //Метод для операции РЕДАКТИРОВАНИЕ
{
    const currentUserId = req.user.userId; //ловим айди пользователя, подавшего запрос, вставляем её в переменную currentUserId
    const id = Number(req.params.id);
    const text = req.body.text;
    try {
            const updatedTask = await prisma.task.update
            (
                {
                    where:
                    {
                        id:id,
                        userId:currentUserId
                    },

                    data:
                    {
                        text:text
                    }
                }
            )  
            return res.send(updatedTask); 
        }
        // Если Призма выдала ошибку (запись не найдена), код мгновенно прыгает в блок catch!
        catch (error) 
            {
                // Ловим ошибку и вместо падения сервера отдаем аккуратный статус 404 (Не найдено)
                return res.status(404).send({ error: "Задача не найдена или доступ запрещен" });
            }
})

app.post('/logout', (req, res) => {
    // 1. Метод clearCookie удаляет куку с указанным именем из браузера
    // 2. Склеиваем метод через точку с финальной отправкой ответа
    // 3. Используем return как стоп-кран
    return res.clearCookie('token').json({ message: "Вы успешно вышли из системы!" });
});

app.listen(3000, () => console.log("Server activated in port 3000")); //заставляем сервер "слушать" 3000-й порт, выводим в консоль сообщение то что сервер активирован на порту 3000