//весь данный файл - это аутентификация

const jwt = require('jsonwebtoken'); //для создания токенов (аутентификации)
// 1. Импортируем Enum статус-кодов (поднимаемся на уровень выше через ..)
const HttpStatus = require('../constants/httpStatuses');

function authenticateToken (req, res, next)
    {
        const token = req.cookies.token; //в main файле server.js есть подключение: app.use (cookieParser('СЕКРЕТНОЕ_СЛОВО_ДЛЯ_ПОДПИСИ')), лепит "ярлыки"-токены на каждого юзера для его аутентификации
                
        if (!token) return res.sendStatus(HttpStatus.UNAUTHORIZED); //в случае если токена нет вообще выдаём сис.ошибку;

        jwt.verify(token, process.env.JWT_SECRET, (err, user) => //верификация, берёт токен, секретное слово, ошибку (если таковая имеется в токене, id user-a)
        //(err, user) => { ... }. Это встроенная функция обратного вызова (Callback)
        // Метод jwt.verify берет token и 'СЕКРЕТНОЕ_СЛОВО_ДЛЯ_ПОДПИСИ' и проводит мгновенный расчет подписи.

        // После расчёта Метод jwt.verify автоматически запускает мини-программу в скобках и передает в неё два результата (аргумента):err (Ошибка): 
        // Если токен поддельный, изменен хакером или у него просто истек срок годности (прошел 1 час), Призма/JWT запишет информацию об ошибке в 
        // эту переменную err. Если всё хорошо, там будет пусто (null).user (Расшифрованные данные): Если токен настоящий, компьютер успешно достанет 
        // из него ту самую полезную нагрузку, которую мы зашивали при логине — объект { userId: user.id } (/services/auht.js, login) — и запишет его в переменную user.
            {
                if (err) return res.sendStatus(HttpStatus.FORBIDDEN); // Проверяем, появилась ли ошибка в переменной err, Ошибка 403 Forbidden (Токен поддельный или просрочен), ошибка будет в случае изменения токена от момента его создания до момента проверки
                    
                // Если ошибка есть, мы бьем пользователя кодом 403 Forbidden (Доступ запрещен, токен «битый»)
                // Если ошибки нет, код идет на следующую строчку:
                
                req.user = user; //изначально запрос от пользователя подаётся "обезличенно", мы используем функцию верификации для того чтобы "наделить его личиной", приклеиваем к его запросу его id
                // чтобы другие функции могли понимать что это конкретный пользователь !userName

                // Записываем расшифрованного юзера (его id) прямо внутрь запроса req
                // Объект req (Request / Запрос) — это сквозной поезд, который едет через весь сервер от момента, когда пользователь кликнул 
                // кнопку, до момента, когда сервер отдал ответ.Мы берем расшифрованные данные пользователя (его userId) и принудительно 
                // подсаживаем их в этот поезд — создаем новое свойство req.user.

                // Благодаря этой строчке, во всех следующих функциях (например, при создании задачи) нам больше не нужно будет спрашивать у пользователя его ID. 
                // Мы сможем просто написать const authorId = req.user.userId; — и сервер будет железно знать, кто именно сейчас отправляет запрос

                next(); // Она буквально говорит серверу: «Всё отлично! Токен проверен, ID пользователя сохранен в поезде req. 
                // Шлагбаум открывается, пропускай этот запрос дальше к коду работы с задачами!»

                // «Библиотека JWT, проверь этот token с помощью нашего секретного слова. Если он фальшивый или просроченный — верни ошибку err 
                // и мы выгоним пользователя с кодом 403. А если он настоящий — достань из него данные пользователя, запиши их в поезд req.user 
                // для следующих функций и дай зеленый свет next(), чтобы пропустить запрос дальше».
            });
    }

    module.exports = authenticateToken;
