const jwt = require('jsonwebtoken'); //для создания токенов (аутентификации)

function authenticateToken (req, res, next)
    {
        const token = req.cookies.token;
        
        //старого швейцара с деменцией убираем

        //const authHeader = req.headers['authorization']; //По стандартам интернета, токены присылают в скрытом заголовке запроса под названием Authorization
        // Обычно заголовок 'headers' выглядит как строка: Bearer (далее например:) <eyJhbGciOiJIUzI1NiIsInR5cCI>. 
        // Нам нужно забрать только вторую часть (сам токен). Для этого разработчики очищают строку:
        //const token = authHeader && authHeader.split(' ')[1]; // && "правый" швейцар с деменцией, смотрит на левую часть, если в ней что-то есть то "ОК", идём дальше, смотрит на правую часть - что-то есть?
        // Круто, записываем это в результат token!
        // В случае если в левой части будет пустота, то он её присвоит токену (что за ах-логика..)

        // Сравнивает authHeader И authHeader.split(' ')[1];
        // Если слева пустота, то останавливает работу и возвращает пустоту в переменную токен;
        // Зачем это нужно? 
        // Если бы мы написали просто const token = authHeader.split(' ')[1];, а пользователь отправил запрос вообще без заголовка, 
        // компьютер попытался бы вызвать метод .split() у пустоты (undefined). 
        // Из-за этого ваш сервер Node.js тут же упал бы с критической ошибкой TypeError: 
        // Cannot read properties of undefined (reading 'split'). Склеивание через && — это изящная страховка «на лету».

        // Метод .split(' ') — берет эту строку и разрезает её на кусочки везде, где встречает пробел (который мы указали в круглых скобок). 
        // На выходе получается массив из двух элементов:Ячейка [0]: Слово "Bearer"Ячейка [1]: Сам длинный токен "eyJhbGci..."
        // Квадратные скобки [1] на конце — говорят компьютеру: «Так, ты разрезал строку на массив из двух кусочков. 
        // Кусочек под номером 0 (слово Bearer) нам не нужен, выкинь его. Возьми кусочек под номером 1 (сам токен)».
        // И этот чистый токен без лишних слов записывается в константу token

        // «Компьютер, проверь, прислал ли пользователь заголовок authHeader. Если не прислал — не ломайся, а просто запиши в token пустоту. 
        // А если прислал — разрежь эту строку по пробелу и возьми вторую часть, где лежит сам токен».
        if (!token) return res.sendStatus(401); //в случае если токена нет вообще выдаём сис.ошибку;

        jwt.verify(token, 'СЕКРЕТНОЕ_СЛОВО_ДЛЯ_ПОДПИСИ', (err, user) => //верификация, берёт токен, секретное слово, ошибку (если таковая имеется в токене, id user-a)
        //(err, user) => { ... }. Это встроенная функция обратного вызова (Callback)
        // Метод jwt.verify берет token и 'СЕКРЕТНОЕ_СЛОВО_ДЛЯ_ПОДПИСИ' и проводит мгновенный расчет подписи.

        // После расчёта Метод jwt.verify автоматически запускает вашу мини-программу в скобках и передает в неё два результата (аргумента):err (Ошибка): 
        // Если токен поддельный, изменен хакером или у него просто истек срок годности (прошел 1 час), Призма/JWT запишет информацию об ошибке в 
        // эту переменную err. Если всё хорошо, там будет пусто (null).user (Расшифрованные данные): Если токен настоящий, компьютер успешно достанет 
        // из него ту самую полезную нагрузку, которую мы зашивали при логине — объект { userId: user.id } — и запишет его в переменную user.
            {
                if (err) return res.sendStatus(403); // Проверяем, появилась ли ошибка в переменной err, Ошибка 403 Forbidden (Токен поддельный или просрочен), ошибка будет в случае изменения токена от момента его создания до момента проверки
                    
                // Если ошибка есть, мы бьем пользователя кодом 403 Forbidden (Доступ запрещен, токен «битый»)
                // Если ошибки нет, код идет на следующую строчку:
                
                req.user = user; //изначально запрос от пользователя подаётся "обезличенно", мы используем функцию верификации для того чтобы "наделить его личиной", приклеиваем к его запросу его id
                // чтобы другие функции могли понимать что это конкретный пользователь !userName

                // Записываем расшифрованного юзера (его id) прямо внутрь запроса req!
                // Объект req (Request / Запрос) — это сквозной поезд, который едет через весь ваш сервер от момента, когда пользователь кликнул 
                // кнопку, до момента, когда сервер отдал ответ.Мы берем расшифрованные данные пользователя (его userId) и принудительно 
                // подсаживаем их в этот поезд — создаем новое свойство req.user.

                // Благодаря этой строчке, во всех следующих функциях (например, при создании задачи) нам больше не нужно будет спрашивать у пользователя его ID. 
                // Мы сможем просто написать const authorId = req.user.userId; — и сервер будет железно знать, кто именно сейчас отправляет запрос


                next(); // Она буквально говорит серверу: «Всё отлично! Токен проверен, ID пользователя сохранен в поезде req. 
                // Шлагбаум открывается, пропускай этот запрос дальше к коду работы с задачами!»

                // «Библиотека JWT, проверь этот token с помощью нашего секретного слова. Если он фальшивый или просроченный — верни ошибку err 
                // и мы выгоним пользователя с кодом 403. А если он настоящий — достань из него данные пользователя, запиши их в поезд req.user 
                // для следующих функций и дай зеленый свет next(), чтобы пропустить запрос дальше».
            });
    }

    module.exports = authenticateToken;
